src/loadtest1.yml
config:
  target: "wss://websockets.tlcmodular.com/app/tlc-key?protocol=7&client=js&version=7.6.0&flash=false"
  phases:
    # - duration: 60  # Test for 60 seconds
    #   arrivalRate: 10 # Every second, add 10 users
    #   rampTo: 100 # And ramp it up to 100 users in total over the 60s period
    #   name: "Ramping up the load"
    - duration: 60 # Then resume the load test for 120s
      arrivalRate: 100 # With those 100 users we ramped up to in the first phase
      rampTo: 500 # And keep it steady at 100 users
      name: "Pushing a constant load"
scenarios:
  - engine: "ws"
    flow:
      - send: 'hello'
      - think: 5